* WORK Orbisr R package
:PROPERTIES:
:ID:       org:qgc7f3t0y5i0
:END:
:LOGBOOK:
- Reference from [[out-id:org:a8ydeiq0y5i0][ts-µ-geo]] on [2019-03-19 Tue 08:31]
- State "WORK"       from "PROJ"       [2019-01-19 Sat 13:25]
CLOCK: [2018-05-27 Sun 21:25]--[2018-05-27 Sun 22:00] =>  0:35
- State "PROJ"    from              [2018-05-27 Sun 21:25]
:END:

** FIRM Function that filters orbis table
CLOSED: [2018-05-27 Sun 23:43]
:LOGBOOK:
- State "FIRM"       from "OPEN"       [2018-05-27 Sun 23:43]
- State "OPEN"       from "TASK"       [2018-05-27 Sun 22:01]
CLOCK: [2018-05-27 Sun 22:01]--[2018-05-27 Sun 23:43] =>  1:42
- State "TASK"       from              [2018-05-27 Sun 21:27]
:END:

** FIRM Fuction that read txt files and saves to many rds
CLOSED: [2018-05-29 Tue 00:10]
:LOGBOOK:
- State "FIRM"       from "OPEN"       [2018-05-29 Tue 00:10]
CLOCK: [2018-05-28 Mon 20:56]--[2018-05-29 Tue 00:10] =>  3:14
- State "OPEN"       from "TASK"       [2018-05-28 Mon 18:45]
CLOCK: [2018-05-28 Mon 18:45]--[2018-05-28 Mon 19:05] =>  0:20
- State "TASK"       from              [2018-05-27 Sun 21:26]
:END:




** FIRM Function that unpack the rar files
CLOSED: [2018-06-07 Thu 12:19]
:LOGBOOK:
- State "FIRM"       from "TASK"       [2018-06-07 Thu 12:19]
- State "TASK"       from              [2018-05-27 Sun 21:26]
:END:


** OPEN Harmonize org names function
:LOGBOOK:
CLOCK: [2019-03-19 Tue 10:19]
CLOCK: [2019-03-18 Mon 20:55]--[2019-03-18 Mon 21:00] =>  0:05
- State "OPEN"       from "TASK"       [2019-03-18 Mon 19:20]
CLOCK: [2019-03-18 Mon 19:20]--[2019-03-18 Mon 19:58] =>  0:38
- State "TASK"       from              [2018-05-27 Sun 21:28]
:END:

- maybe include it as part of orbis.save.rds
- it makes more sence because it will save reding time and space...
- undesctend what is with DESCRIPTION
- install it
- test it

** TASK General deploy function with settings
:LOGBOOK:
- State "TASK"       from              [2018-05-27 Sun 21:27]
:END:

- [ ] unpack files
- [ ] read and save rds
- [ ] delete files
- [ ] do it one by one to save disk space

** FIRM Add files filtering based on regex
CLOSED: [2019-01-19 Sat 13:25]
:LOGBOOK:
- State "FIRM"       from "OPEN"       [2019-01-19 Sat 13:25]
- State "OPEN"       from "TASK"       [2019-01-19 Sat 13:16]
CLOCK: [2019-01-19 Sat 13:16]--[2019-01-19 Sat 13:25] =>  0:09
- State "TASK"       from              [2019-01-18 Fri 06:36]
:END:
** FIRM Functions that searches org names and returns binded table
CLOSED: [2019-01-19 Sat 13:25]
:LOGBOOK:
- State "FIRM"       from "TASK"       [2019-01-19 Sat 13:25]
- State "TASK"       from              [2018-05-27 Sun 21:29]
:END:

** FIRM add select cols to orbiser.filter
CLOSED: [2019-01-11 Fri 19:24]
:LOGBOOK:
- State "FIRM"       from "TASK"       [2019-01-11 Fri 19:24]
- State "TASK"       from              [2019-01-11 Fri 18:28]
:END:
** FIRM rename orbis.data.filter to orbis.filter
CLOSED: [2019-01-18 Fri 06:36]
:LOGBOOK:
- State "FIRM"       from "TASK"       [2019-01-18 Fri 06:36]
- State "TASK"       from              [2019-01-11 Fri 19:24]
:END:
